{"modelTopology": {"keras_version": "2.2.0", "backend": "tensorflow", "model_config": {"config": {"layers": [{"name": "input_5", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "sparse": false, "name": "input_5"}}, {"name": "conv2d_77", "inbound_nodes": [[["input_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_77", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 24}}, {"name": "activation_89", "inbound_nodes": [[["conv2d_77", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_89", "activation": "elu", "trainable": true}}, {"name": "conv2d_78", "inbound_nodes": [[["activation_89", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_78", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 24}}, {"name": "activation_90", "inbound_nodes": [[["conv2d_78", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_90", "activation": "elu", "trainable": true}}, {"name": "max_pooling2d_17", "inbound_nodes": [[["activation_90", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_17", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"name": "dropout_53", "inbound_nodes": [[["max_pooling2d_17", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_53", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.15}}, {"name": "conv2d_79", "inbound_nodes": [[["dropout_53", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_79", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 48}}, {"name": "activation_91", "inbound_nodes": [[["conv2d_79", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_91", "activation": "elu", "trainable": true}}, {"name": "conv2d_80", "inbound_nodes": [[["activation_91", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_80", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 48}}, {"name": "activation_92", "inbound_nodes": [[["conv2d_80", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_92", "activation": "elu", "trainable": true}}, {"name": "max_pooling2d_18", "inbound_nodes": [[["activation_92", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_18", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"name": "dropout_54", "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_54", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.15}}, {"name": "conv2d_81", "inbound_nodes": [[["dropout_54", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_81", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 96}}, {"name": "activation_93", "inbound_nodes": [[["conv2d_81", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_93", "activation": "elu", "trainable": true}}, {"name": "conv2d_82", "inbound_nodes": [[["activation_93", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_82", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 96}}, {"name": "activation_94", "inbound_nodes": [[["conv2d_82", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_94", "activation": "elu", "trainable": true}}, {"name": "max_pooling2d_19", "inbound_nodes": [[["activation_94", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_19", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"name": "dropout_55", "inbound_nodes": [[["max_pooling2d_19", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_55", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.15}}, {"name": "conv2d_83", "inbound_nodes": [[["dropout_55", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_83", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 192}}, {"name": "activation_95", "inbound_nodes": [[["conv2d_83", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_95", "activation": "elu", "trainable": true}}, {"name": "conv2d_84", "inbound_nodes": [[["activation_95", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_84", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 192}}, {"name": "activation_96", "inbound_nodes": [[["conv2d_84", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_96", "activation": "elu", "trainable": true}}, {"name": "max_pooling2d_20", "inbound_nodes": [[["activation_96", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_20", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"name": "dropout_56", "inbound_nodes": [[["max_pooling2d_20", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_56", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.15}}, {"name": "conv2d_85", "inbound_nodes": [[["dropout_56", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_85", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 384}}, {"name": "activation_97", "inbound_nodes": [[["conv2d_85", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_97", "activation": "elu", "trainable": true}}, {"name": "conv2d_86", "inbound_nodes": [[["activation_97", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_86", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 384}}, {"name": "activation_98", "inbound_nodes": [[["conv2d_86", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_98", "activation": "elu", "trainable": true}}, {"name": "dropout_57", "inbound_nodes": [[["activation_98", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_57", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.15}}, {"name": "conv2d_transpose_17", "inbound_nodes": [[["dropout_57", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_17", "data_format": "channels_last", "bias_constraint": null, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 384}}, {"name": "activation_99", "inbound_nodes": [[["conv2d_transpose_17", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_99", "activation": "elu", "trainable": true}}, {"name": "dropout_58", "inbound_nodes": [[["activation_99", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_58", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.15}}, {"name": "concatenate_17", "inbound_nodes": [[["dropout_58", 0, 0, {}], ["activation_96", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_17", "axis": -1, "trainable": true}}, {"name": "conv2d_87", "inbound_nodes": [[["concatenate_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_87", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 192}}, {"name": "activation_100", "inbound_nodes": [[["conv2d_87", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_100", "activation": "elu", "trainable": true}}, {"name": "conv2d_88", "inbound_nodes": [[["activation_100", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_88", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 192}}, {"name": "activation_101", "inbound_nodes": [[["conv2d_88", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_101", "activation": "elu", "trainable": true}}, {"name": "dropout_59", "inbound_nodes": [[["activation_101", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_59", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.15}}, {"name": "conv2d_transpose_18", "inbound_nodes": [[["dropout_59", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_18", "data_format": "channels_last", "bias_constraint": null, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 192}}, {"name": "activation_102", "inbound_nodes": [[["conv2d_transpose_18", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_102", "activation": "elu", "trainable": true}}, {"name": "dropout_60", "inbound_nodes": [[["activation_102", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_60", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.15}}, {"name": "concatenate_18", "inbound_nodes": [[["dropout_60", 0, 0, {}], ["activation_94", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_18", "axis": -1, "trainable": true}}, {"name": "conv2d_89", "inbound_nodes": [[["concatenate_18", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_89", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 96}}, {"name": "activation_103", "inbound_nodes": [[["conv2d_89", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_103", "activation": "elu", "trainable": true}}, {"name": "conv2d_90", "inbound_nodes": [[["activation_103", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_90", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 96}}, {"name": "activation_104", "inbound_nodes": [[["conv2d_90", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_104", "activation": "elu", "trainable": true}}, {"name": "dropout_61", "inbound_nodes": [[["activation_104", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_61", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.15}}, {"name": "conv2d_transpose_19", "inbound_nodes": [[["dropout_61", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_19", "data_format": "channels_last", "bias_constraint": null, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 96}}, {"name": "activation_105", "inbound_nodes": [[["conv2d_transpose_19", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_105", "activation": "elu", "trainable": true}}, {"name": "dropout_62", "inbound_nodes": [[["activation_105", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_62", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.15}}, {"name": "concatenate_19", "inbound_nodes": [[["dropout_62", 0, 0, {}], ["activation_92", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_19", "axis": -1, "trainable": true}}, {"name": "conv2d_91", "inbound_nodes": [[["concatenate_19", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_91", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 48}}, {"name": "activation_106", "inbound_nodes": [[["conv2d_91", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_106", "activation": "elu", "trainable": true}}, {"name": "conv2d_92", "inbound_nodes": [[["activation_106", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_92", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 48}}, {"name": "activation_107", "inbound_nodes": [[["conv2d_92", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_107", "activation": "elu", "trainable": true}}, {"name": "dropout_63", "inbound_nodes": [[["activation_107", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_63", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.15}}, {"name": "conv2d_transpose_20", "inbound_nodes": [[["dropout_63", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_20", "data_format": "channels_last", "bias_constraint": null, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 48}}, {"name": "activation_108", "inbound_nodes": [[["conv2d_transpose_20", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_108", "activation": "elu", "trainable": true}}, {"name": "dropout_64", "inbound_nodes": [[["activation_108", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_64", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.15}}, {"name": "concatenate_20", "inbound_nodes": [[["dropout_64", 0, 0, {}], ["activation_90", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_20", "axis": -1, "trainable": true}}, {"name": "conv2d_93", "inbound_nodes": [[["concatenate_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_93", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 24}}, {"name": "activation_109", "inbound_nodes": [[["conv2d_93", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_109", "activation": "elu", "trainable": true}}, {"name": "conv2d_94", "inbound_nodes": [[["activation_109", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_94", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 24}}, {"name": "activation_110", "inbound_nodes": [[["conv2d_94", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_110", "activation": "elu", "trainable": true}}, {"name": "dropout_65", "inbound_nodes": [[["activation_110", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_65", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.15}}, {"name": "conv2d_95", "inbound_nodes": [[["dropout_65", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_95", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "filters": 1}}], "name": "model_5", "input_layers": [["input_5", 0, 0]], "output_layers": [["conv2d_95", 0, 0]]}, "class_name": "Model"}, "training_config": {"loss_weights": null, "metrics": [], "optimizer_config": {"config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "amsgrad": false, "epsilon": 1e-07}, "class_name": "Adam"}, "sample_weight_mode": null, "loss": "binary_crossentropy"}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv2d_77/kernel", "shape": [3, 3, 1, 24], "dtype": "float32"}, {"name": "conv2d_77/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "conv2d_78/kernel", "shape": [3, 3, 24, 24], "dtype": "float32"}, {"name": "conv2d_78/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "conv2d_79/kernel", "shape": [3, 3, 24, 48], "dtype": "float32"}, {"name": "conv2d_79/bias", "shape": [48], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "conv2d_80/kernel", "shape": [3, 3, 48, 48], "dtype": "float32"}, {"name": "conv2d_80/bias", "shape": [48], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "conv2d_81/kernel", "shape": [3, 3, 48, 96], "dtype": "float32"}, {"name": "conv2d_81/bias", "shape": [96], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "conv2d_82/kernel", "shape": [3, 3, 96, 96], "dtype": "float32"}, {"name": "conv2d_82/bias", "shape": [96], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "conv2d_83/kernel", "shape": [3, 3, 96, 192], "dtype": "float32"}, {"name": "conv2d_83/bias", "shape": [192], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "conv2d_84/kernel", "shape": [3, 3, 192, 192], "dtype": "float32"}, {"name": "conv2d_84/bias", "shape": [192], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "conv2d_85/kernel", "shape": [3, 3, 192, 384], "dtype": "float32"}, {"name": "conv2d_85/bias", "shape": [384], "dtype": "float32"}]}, {"paths": ["group10-shard1of2", "group10-shard2of2"], "weights": [{"name": "conv2d_86/kernel", "shape": [3, 3, 384, 384], "dtype": "float32"}, {"name": "conv2d_86/bias", "shape": [384], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "conv2d_87/kernel", "shape": [3, 3, 576, 192], "dtype": "float32"}, {"name": "conv2d_87/bias", "shape": [192], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "conv2d_88/kernel", "shape": [3, 3, 192, 192], "dtype": "float32"}, {"name": "conv2d_88/bias", "shape": [192], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "conv2d_89/kernel", "shape": [3, 3, 288, 96], "dtype": "float32"}, {"name": "conv2d_89/bias", "shape": [96], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "conv2d_90/kernel", "shape": [3, 3, 96, 96], "dtype": "float32"}, {"name": "conv2d_90/bias", "shape": [96], "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "conv2d_91/kernel", "shape": [3, 3, 144, 48], "dtype": "float32"}, {"name": "conv2d_91/bias", "shape": [48], "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "conv2d_92/kernel", "shape": [3, 3, 48, 48], "dtype": "float32"}, {"name": "conv2d_92/bias", "shape": [48], "dtype": "float32"}]}, {"paths": ["group17-shard1of1"], "weights": [{"name": "conv2d_93/kernel", "shape": [3, 3, 72, 24], "dtype": "float32"}, {"name": "conv2d_93/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "conv2d_94/kernel", "shape": [3, 3, 24, 24], "dtype": "float32"}, {"name": "conv2d_94/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group19-shard1of1"], "weights": [{"name": "conv2d_95/kernel", "shape": [3, 3, 24, 1], "dtype": "float32"}, {"name": "conv2d_95/bias", "shape": [1], "dtype": "float32"}]}, {"paths": ["group20-shard1of2", "group20-shard2of2"], "weights": [{"name": "conv2d_transpose_17/kernel", "shape": [3, 3, 384, 384], "dtype": "float32"}, {"name": "conv2d_transpose_17/bias", "shape": [384], "dtype": "float32"}]}, {"paths": ["group21-shard1of1"], "weights": [{"name": "conv2d_transpose_18/kernel", "shape": [3, 3, 192, 192], "dtype": "float32"}, {"name": "conv2d_transpose_18/bias", "shape": [192], "dtype": "float32"}]}, {"paths": ["group22-shard1of1"], "weights": [{"name": "conv2d_transpose_19/kernel", "shape": [3, 3, 96, 96], "dtype": "float32"}, {"name": "conv2d_transpose_19/bias", "shape": [96], "dtype": "float32"}]}, {"paths": ["group23-shard1of1"], "weights": [{"name": "conv2d_transpose_20/kernel", "shape": [3, 3, 48, 48], "dtype": "float32"}, {"name": "conv2d_transpose_20/bias", "shape": [48], "dtype": "float32"}]}]}